"""Parser test reference values."""


ref_actual_folder_names = {
    'Бакалія',
    'Крупи',
    'Гречана крупа',
    'Кукурудзяна крупа',
    'Рис',
    'Протеїнові батончики',
    'Їжа швидкого приготування',
    'Снеки',
    'Чіпси',
}

ref_deprecated_folder_names = {
    'Deprecated folder 1',
    'Deprecated folder 2',
    'Deprecated folder 3',
}

ref_actual_product_names = {
    'Крупа Українська Зірка Гречана 1 кг',
    'Крупа Хуторок Гречана 800 г',
    'Крупа Сквирянка Гречана 800 г',
    'Крупа Сквирянка Гречана 800 г непропарена',
    'Крупа Українська Зірка 800 г Кукурудзяна',
    'Крупа Терра Кукурудзяна 5х80 г',
    'Крупа Моя Країна Кукурудзяна 600 г',
    'Крупа Жменька Кукурудзяна 300 г картон',
    'Рис круглий ваг.',
    'Рис Хуторок 800 г круглий',
    'Рис Трапеза 500 г Басматі пропарений',
    'Рис Хуторок 800 г пропарений',
    'Батончик протеїновий Healthy Meal 40 г з фісташками глазур.',
    'Батончик протеїновий Vale 4Energy 40 г вишня',
    'Батончик протеїновий Vale 40 г полуниця',
    'Батончик Biotech Protein Bar 70 г Strawberry',
    'Локшина Роллтон яєчна 75 г стак. зі смаком Курки по-домашньому',
    'Пюре картопл. Эко 30 г Вершкове',
    'Каша Терра вівсяна з верш. 38 г з абрикосом',
    'Каша Терра 38 г вівсяна з яблуком та корицею',
    'Каша Вівсянушка 40 г з ананасом',
    'Каша Вівсянушка Подвійна насолода 47 г з бананом та полуницею',
    'Суп Тетя Соня 60 г пак. Курячий зірочки',
    'Суп Тетя Соня Гороховий 180 г брик. Харчо',
    'Крупа Гречана ваг.',
    'Крупа Жменька Гречана 400 г Ядриця',
    'Рис Трапеза 500 г Жасмін Таїланд',
    'Рис Трапеза 500 г Басматі Гімалаї',
    'Батончик Biotech Protein Bar 70 г salted caramel',
    'Батончик Biotech Protein Bar 70 г Banana',
    'Крупа Суббота Кукурудзяна 800 г',
    'Крупа Жменька Кукурудзяна 800 г',
    'Каша Овсяночка 450 г Асорті',
    'Каша Терра вівсяна 38 г з ананасом',
}

ref_deprecated_product_names = {
    'Deprecated product 1',
    'Deprecated product 2',
    'Deprecated product 3',
    'Deprecated product 4',
}
